Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Роли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьПользователя(Команда)
	СоздатьПользователяНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователяНаСервере()
	Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	Пользователь.Имя = Объект.Наименование;
	Пользователь.Пароль = Объект.Пароль;
	
	Мета = Метаданные.Роли;
	Для каждого Строка  Из Объект.Роли  Цикл
	    Стр = Строка.Роль;
		Пользователь.Роли.Добавить(Мета.Найти(Стр.Наименование));
	
	КонецЦикла;
	
	Пользователь.Записать();
КонецПроцедуры
